Revit 2024 API
RoomFilter Constructor
 Constructs a filter which matches only rooms.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public RoomFilter()
Visual Basic
Public Sub New
Visual C++
public:
RoomFilter()
See Also
RoomFilter Class
Autodesk.Revit.DB.Architecture Namespace